code-review/NRB_3471_3546/База_Стало/DataProcessors/ЭкспортПорученийВЛуч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЭкспортПорученийВЛуч</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПроверенные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезСтатусаОтменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПроведенные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПринятыеВОбработку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SWIFTБанка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаБанковскогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
								<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСделки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КВыгрузке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАльфа2СтраныЮрлицаКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДепонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗагрузкиКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КраткийКодНРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МХКонтрагентКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБанковскогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДепозитарногоДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДепозитарногоДоговораКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяДатаРасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименованиеКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НеттоПоручение</v8:Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоКонтрагентаКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоКонтрагентаКраткийКодНРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоКраткийКодНРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Референс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоКонтрагентаКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоМХКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХКонтрагентаКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БикКлиентаДепозитария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусФШ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоручения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыИнвентарныхПоручений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераВерсий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ДокументыВыгруженныеВЛуч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыВыгруженныеВЛуч</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаРазделаРСВвВышестоящийДепозитарий</v8:Type>
						<v8:Type>cfg:DocumentRef.НеттоПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ПризнакиСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакиСчетаДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетДепонента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ЭкспортПорученийВЛуч/Ext/ObjectModule.bsl
//Перем КодЗагрузкиОрганизации;

//////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС МОДУЛЯ

Процедура ЗаполнитьПоручения(ВыгружаемыйДокумент = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧПоручения.Поручение КАК Основание
	|ПОМЕСТИТЬ втНеттоПоручения
	|ИЗ
	|	Документ.НеттоПоручение.Поручения КАК ТЧПоручения
	|ГДЕ
	|	ТЧПоручения.Ссылка.Проведен";
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаПоручений();
	Запрос.УстановитьПараметр("НДЦ",			Константы.КлассификаторЗагрузкиНДЦ.Получить());
	Запрос.УстановитьПараметр("МестоХранения",	Константы.МестоХраненияПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("ВнешнийБрокер",	Константы.ВнешнийБрокер.Получить());
	
	Запрос.УстановитьПараметр("ТолькоПроверенные",			ТолькоПроверенные);
	Запрос.УстановитьПараметр("ТолькоПринятыеВОбработку",	ТолькоПринятыеВОбработку);
	
	Если ЗначениеЗаполнено(ВыгружаемыйДокумент) Тогда
		Запрос.УстановитьПараметр("ВыгружаемыйДокумент", ВыгружаемыйДокумент);
		Запрос.УстановитьПараметр("ВыгрузитьБезусловно", Истина);
		ДополнительныеУсловияОтбора = "Ссылка В (&ВыгружаемыйДокумент)";
		Запрос.УстановитьПараметр("КонецДня",	КонецДня(ТекущаяДатаСеанса()));
	Иначе
		Запрос.УстановитьПараметр("НачалоДня",	НачалоДня(ОбщегоНазначения.ДобавитьРабочийДень(ДатаВыгрузки, -3)));
		Запрос.УстановитьПараметр("КонецДня",	КонецДня(ДатаВыгрузки));
		Запрос.УстановитьПараметр("ВыгрузитьБезусловно", Ложь);
		ДополнительныеУсловияОтбора = "Дата МЕЖДУ &НачалоДня И &КонецДня";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеУсловияОтбора", ДополнительныеУсловияОтбора);
	
	Запрос.УстановитьПараметр("СчетКонтрагента",		Перечисления.ПризнакиСчетаДепо.СчетКонтрагента);
	Запрос.УстановитьПараметр("ПустойСчетДепо",			Справочники.СчетаДепо.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяВалюта",			Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Депонирование",			Справочники.ВидыОпераций.Депонирование);
	Запрос.УстановитьПараметр("СнятиеСДепонирования",	Справочники.ВидыОпераций.СнятиеСДепонирования);
	Запрос.УстановитьПараметр("ПереводМеждуРазделамиСчетаДепо",
		Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	Запрос.УстановитьПараметр("ОткрытиеРазделаСчетаДепо",
		Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо);
	Запрос.УстановитьПараметр("ЗакрытиеРазделаСчетаДепо",Справочники.ВидыОпераций.ЗакрытиеРазделаСчетаДепо);
	Запрос.УстановитьПараметр("Перемещение",			Справочники.ВидыОпераций.Перемещение);
	Запрос.УстановитьПараметр("Налоговый",				Перечисления.ТипыРазделовСчетовДЕПО.Налоговый);
	Запрос.УстановитьПараметр("ЮрЛицо",					Перечисления.ЮрФизЛицо.ЮрЛицо);
	Запрос.УстановитьПараметр("ФизЛицо",				Перечисления.ЮрФизЛицо.ФизЛицо);
	Запрос.УстановитьПараметр("БезСтатусаОтменено",		БезСтатусаОтменено);
	Запрос.УстановитьПараметр("ТолькоПроведенные",		ТолькоПроведенные);
	
	МассивСтатусовКВыгрузке = Новый Массив;
	МассивСтатусовКВыгрузке.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.ВыгрузитьФайловыйШлюз);
	МассивСтатусовКВыгрузке.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.ОшибкаФайловыйШлюз);
	МассивСтатусовКВыгрузке.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.НеПринятоКИсполнению);
	МассивСтатусовКВыгрузке.Добавить(Перечисления.СтатусыДокументовФайловыйШлюз.НеИсполнено);	
	
	Запрос.УстановитьПараметр("МассивСтатусовКВыгрузке", МассивСтатусовКВыгрузке);
	
	Поручения.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

// Возвращает структуру с описанием ошибки, если она обнаружена. Иначе - Неопределено.
// Возвращаемое значение:
//	- Структура
Функция РезультатВыгрузкиПоручений() Экспорт
	
	Ошибка = ВнешниеДанные.НовоеОписаниеОшибкиДляРегистрацииИОповещения();
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	
	ФормироватьФайлыПоСхемеВидовИнвентарныхПоручений = Константы.ФормироватьФайлыПоСхемеВидовИнвентарныхПоручений.Получить();	
	
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	НДЦ = Константы.КлассификаторЗагрузкиНДЦ.Получить();
	КодЗагрузкиОрганизации = Справочники.Организации.КодЗагрузки(Организация, НДЦ, ДатаВыгрузки);
	Если НЕ ЗначениеЗаполнено(КодЗагрузкиОрганизации) Тогда
		Ошибка.СообщениеВЖурнал = "На " + Формат(ДатаВыгрузки, "ДЛФ=Д") + " не указан код загрузки юр.лица организации";
		Ошибка.Данные = Организация;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + Ошибка.Данные;
		Возврат Ошибка;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьФайловыйШлюзДляОтправкиПоручений") Тогда 
		
		ВремяНачалаРезультатВыгрузкиПоручений = ОценкаПроизводительности.НачатьЗамерВремени();
		ОшибкаВыгрузки = Неопределено;
		
		Для Каждого Строка Из Поручения Цикл
			
			Если Строка.КВыгрузке Тогда
				
				Если ФормироватьФайлыПоСхемеВидовИнвентарныхПоручений Тогда
					ОшибкаВыгрузки = Обработки.ЭкспортПорученийВЛуч.ВыгрузитьПоСхеме(Строка.Поручение);
					Если ЗначениеЗаполнено(ОшибкаВыгрузки) Тогда
						Прервать;
					КонецЕсли;
				Иначе
					ОшибкаВыгрузки = РезультатФормированияПакетаXML_ФШ(Строка, КодЗагрузкиОрганизации);
					Если ЗначениеЗаполнено(ОшибкаВыгрузки) Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОценкаПроизводительности.ЗакончитьЗамерВремени("ЭкспортПорученийВЛуч_РезультатВыгрузкиПоручений", 
			ВремяНачалаРезультатВыгрузкиПоручений, , , ЗначениеЗаполнено(ОшибкаВыгрузки));
		
		Если ЗначениеЗаполнено(ОшибкаВыгрузки) Тогда
			Возврат ОшибкаВыгрузки;
		КонецЕсли;
		
	Иначе	
		
		ВнешнийИсточникКаталогВыгрузки = ПланыВидовХарактеристик.ВнешниеИсточники.КаталогВыгрузкиПорученийВЛуч;
		ПутьДляВыгрузки = ВнешниеДанные.ПутьКВнешнемуИсточникуКаталогу(ВнешнийИсточникКаталогВыгрузки, Ошибка);
		
		Папка = Новый Файл(ПутьДляВыгрузки);
		Если Папка.Существует() И Папка.ЭтоКаталог() Тогда
			
			ВремяНачалаРезультатВыгрузкиПоручений = ОценкаПроизводительности.НачатьЗамерВремени();
			ОшибкаВыгрузки = Неопределено;
			
			Для Каждого Строка Из Поручения Цикл
				
				Если Строка.КВыгрузке Тогда
					ОшибкаВыгрузки = РезультатФормированияПакетаXML(Строка, КодЗагрузкиОрганизации, ПутьДляВыгрузки);
					Если ЗначениеЗаполнено(ОшибкаВыгрузки) Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			ОценкаПроизводительности.ЗакончитьЗамерВремени("ЭкспортПорученийВЛуч_РезультатВыгрузкиПоручений", 
				ВремяНачалаРезультатВыгрузкиПоручений, , , ЗначениеЗаполнено(ОшибкаВыгрузки));
			
			Если ЗначениеЗаполнено(ОшибкаВыгрузки) Тогда
				Возврат ОшибкаВыгрузки;
			КонецЕсли;
			
		Иначе
			Ошибка.СообщениеВЖурнал = "Не существует или отсутствует доступ к каталогу " + ПутьДляВыгрузки
			+ " внешнего источника";
			Ошибка.Данные = ВнешнийИсточникКаталогВыгрузки;
			Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + Ошибка.Данные;
			Возврат Ошибка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура СохранитьЗначенияРеквизитовПоУмолчанию() Экспорт
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	НомераВерсийПоУмолчанию = НомераВерсий.Выгрузить();
	НомераВерсийПроверка = НомераВерсийПоУмолчанию.Скопировать(, "КодОперации");
	НомераВерсийПроверка.Свернуть("КодОперации");
	Если НомераВерсийПоУмолчанию.Количество() > НомераВерсийПроверка.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дублируются кода операций, сохранение настройки невозможно!");
		Возврат;	
	КонецЕсли;
	
	ИмяОбъекта = Метаданные().ПолноеИмя();
	ЗначенияРеквизитов = Новый Структура();
	ЗначенияРеквизитов.Вставить("НомераВерсий", НомераВерсийПоУмолчанию);
	ОбщегоНазначения.НоваяНастройкаЗаполненияДанныхПоУмолчанию(ИмяОбъекта, "Номера версий", Истина, ЗначенияРеквизитов, ДатаВыгрузки);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка заполнения данных по умолчанию сохранена.");
	
КонецПроцедуры

Процедура ВосстановитьЗначенияРеквизитовПоУмолчанию() Экспорт
	
	Если НомераВерсий.Количество() = 0 Тогда	
		ИмяОбъекта = Метаданные().ПолноеИмя();
		НомераВерсийПоУмолчанию = ОбщегоНазначения.ПолучитьЗначенияРеквизитовТабличныхЧастейОбъектаПоУмолчанию(ИмяОбъекта, "НомераВерсий",, "Номера версий", Истина, ДатаВыгрузки);
		Если НомераВерсийПоУмолчанию <> Неопределено Тогда
			НомераВерсий.Загрузить(НомераВерсийПоУмолчанию);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция ТекстЗапросаПоручений()
	Возврат
	"ВЫБРАТЬ
	|	ДокументПоручение.Ссылка КАК Ссылка,
	|	ДокументПоручение.Дата КАК Дата,
	|	ДокументПоручение.Номер КАК Номер,
	|	ВЫРАЗИТЬ(ДокументПоручение.ВидОперацииД КАК Справочник.ВидыОпераций) КАК ВидОперации,
	|	ДокументПоручение.ВидПоручения КАК ВидПоручения,
	|	ДокументПоручение.СчетДепо КАК СчетДепо,
	|	ДокументПоручение.Инициатор КАК Инициатор,
	|	ДокументПоручение.Контрагент КАК Контрагент,
	|	ДокументПоручение.ЦБ КАК ЦБ,
	|	ДокументПоручение.СчетДепоКонтрагента КАК СчетДепоКонтрагента,
	|	ДокументПоручение.МХКонтрагент КАК МХКонтрагент,
	|	ДокументПоручение.СуммаСделки КАК СуммаСделки,
	|	ДокументПоручение.ПланируемаяДатаРасчетов КАК ПланируемаяДатаРасчетов,
	|	ДокументПоручение.БанковскийСчет КАК БанковскийСчет,
	|	ДокументПоручение.ДатаСделки КАК ДатаСделки,
	|	ДокументПоручение.СчетДепоМХ КАК СчетДепоМХ,
	|	ДокументПоручение.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ДокументПоручение.РазделСчетаДепоКонтрагента КАК РазделСчетаДепоКонтрагента,
	|	ДокументПоручение.КоличествоЦБ КАК КоличествоЦБ,
	|	ДокументПоручение.КраткийКодНРД КАК КраткийКодНРД,
	|	ДокументПоручение.Референс КАК Референс,
	|	ЕСТЬNULL(ДокументПоручение.РазделСчетаДепо.КраткийКодНРД, """") КАК РазделСчетаДепоКраткийКодНРД,
	|	ЕСТЬNULL(НеттоПоручения.Основание, ДокументыВыгруженныеВЛуч.ДокументОснование) КАК ПоручениеВВышестоящийДепозитарий,
	|	ДокументПоручение.РазделСчетаДепоМХКонтрагента.Код КАК РазделСчетаДепоМХКонтрагентаКод
	|ПОМЕСТИТЬ втДокументыДляОбработки
	|ИЗ
	|	Документ.Поручение КАК ДокументПоручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНеттоПоручения КАК НеттоПоручения
	|		ПО ДокументПоручение.Ссылка = НеттоПоручения.Основание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|		ПО ДокументПоручение.Ссылка = ДокументыВыгруженныеВЛуч.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПоручений.СрезПоследних(&КонецДня, ) КАК СтатусыПорученийСрезПоследних
	|		ПО ДокументПоручение.Ссылка = СтатусыПорученийСрезПоследних.Поручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭтапыОбработкиПоручений.СрезПоследних(, 1 = 1) КАК ЭтапыОбработкиПоручений
	|		ПО ДокументПоручение.Ссылка = ЭтапыОбработкиПоручений.Поручение
	|ГДЕ
	|	ДокументПоручение.ДатаИсполненияПоручения = ДАТАВРЕМЯ(1, 1, 1)
	|	И ВЫБОР
	|			КОГДА &ТолькоПроверенные
	|				ТОГДА ДокументПоручение.Проверено = ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И &ДополнительныеУсловияОтбора
	|	И ((ВЫРАЗИТЬ(ДокументПоручение.ВидОперацииД КАК Справочник.ВидыОпераций) В (&Депонирование, &СнятиеСДепонирования)
	|				И ДокументПоручение.МХДепонента = &МестоХранения
	|				И ДокументПоручение.Контрагент <> &ВнешнийБрокер)
	|			ИЛИ (ВЫРАЗИТЬ(ДокументПоручение.ВидОперацииД КАК Справочник.ВидыОпераций) В (&ПереводМеждуРазделамиСчетаДепо, &Перемещение))
	|			ИЛИ (ВЫРАЗИТЬ(ДокументПоручение.ВидОперацииД КАК Справочник.ВидыОпераций) = &ОткрытиеРазделаСчетаДепо
	|				И ДокументПоручение.ОткрытьВМХ
	|				И ДокументПоручение.Депонент ССЫЛКА Справочник.МестаХранения)
	|			ИЛИ (ВЫРАЗИТЬ(ДокументПоручение.ВидОперацииД КАК Справочник.ВидыОпераций) = &ЗакрытиеРазделаСчетаДепо
	|				И ДокументПоручение.ЗакрытьВМХ
	|				И ДокументПоручение.Депонент ССЫЛКА Справочник.МестаХранения))
	|	И ВЫБОР
	|			КОГДА &БезСтатусаОтменено
	|				ТОГДА НЕ ЕСТЬNULL(СтатусыПорученийСрезПоследних.СтатусПоручения, 0) = ЗНАЧЕНИЕ(перечисление.статусыпоручений.отменено)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТолькоПроведенные
	|				ТОГДА ДокументПоручение.Проведен
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ТолькоПринятыеВОбработку И ВЫРАЗИТЬ(ДокументПоручение.ВидОперацииД КАК Справочник.ВидыОпераций) В (&Депонирование, &СнятиеСДепонирования)
	|				ТОГДА ДокументПоручение.ПринятьВОбработку
	|						И ЕстьNULL(ЭтапыОбработкиПоручений.Этап, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Справочник.ЭтапыОбработкиПоручений.ИсполнениеВНРД)
	|						И ЕСТЬNULL(СтатусыПорученийСрезПоследних.СтатусПоручения, 0) = ЗНАЧЕНИЕ(Перечисление.СтатусыПоручений.Обрабатывается)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НеттоПоручения.Ссылка,
	|	НеттоПоручения.Дата,
	|	НеттоПоручения.Номер,
	|	НеттоПоручения.ВидОперации,
	|	НеттоПоручения.ВидПоручения,
	|	&ПустойСчетДепо,
	|	"""",
	|	НеттоПоручения.Контрагент,
	|	НеттоПоручения.ЦеннаяБумага,
	|	НеттоПоручения.СчетДепоКонтрагента,
	|	НеттоПоручения.МестоХраненияКонтрагента,
	|	НеттоПоручения.Сумма,
	|	НеттоПоручения.ПланируемаяДатаРасчетов,
	|	НеттоПоручения.БанковскийСчет,
	|	НеттоПоручения.ДатаСделки,
	|	НеттоПоручения.СчетДепоМХ,
	|	НеттоПоручения.РазделСчетаДепоМХ,
	|	НеттоПоручения.РазделСчетаДепоКонтрагента,
	|	НеттоПоручения.Количество,
	|	"""",
	|	НеттоПоручения.Референс,
	|	"""",
	|	ДокументыВыгруженныеВЛуч.ДокументОснование,
	|	""""
	|ИЗ
	|	Документ.НеттоПоручение КАК НеттоПоручения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|		ПО НеттоПоручения.Ссылка = ДокументыВыгруженныеВЛуч.ДокументОснование
	|ГДЕ
	|	НеттоПоручения.ВидОперации В (&Депонирование, &СнятиеСДепонирования)
	|	И НеттоПоручения.Контрагент = &ВнешнийБрокер
	|	И НеттоПоручения.ДатаИсполнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И НеттоПоручения.Количество <> 0
	|	И НеттоПоручения.Проведен
	|	И ВЫБОР КОГДА &ТолькоПроверенные ТОГДА НеттоПоручения.Проверено = ИСТИНА ИНАЧЕ ИСТИНА КОНЕЦ
	|	И &ДополнительныеУсловияОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.Ссылка КАК Поручение,
	|	Документы.Номер КАК Номер,
	|	Документы.Дата КАК Дата,
	|	Документы.ВидОперации КАК ВидОперации,
	|	Документы.ВидПоручения КАК ВидПоручения,
	|	ВЫБОР
	|		КОГДА Документы.ВидОперации = &ОткрытиеРазделаСчетаДепо
	|			ТОГДА Документы.Инициатор
	|	КОНЕЦ КАК Инициатор,
	|	Документы.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(Документы.Контрагент.Код, """") КАК КонтрагентКод,
	|	ЕСТЬNULL(Документы.Контрагент.НаименованиеПолное, """") КАК ПолноеНаименованиеКонтрагента,
	|	ЕСТЬNULL(Документы.Контрагент.Наименование, """") КАК НаименованиеКонтрагента,
	|	ВЫБОР
	|		КОГДА Документы.Контрагент.ЮрФизЛицо = &ФизЛицо
	|			ТОГДА ""I""
	|		КОГДА Документы.Контрагент.ЮрФизЛицо = &ЮрЛицо
	|			ТОГДА ""J""
	|	КОНЕЦ КАК ЮрФизЛицо,
	|	ЕСТЬNULL(КодыЗагрузкиКонтрагента.Код, """") КАК КодЗагрузкиКонтрагента,
	|	ВЫРАЗИТЬ(Документы.СчетДепо КАК Справочник.СчетаДепо).Владелец КАК Депонент,
	|	ВЫБОР
	|		КОГДА Документы.ВидОперации = &ОткрытиеРазделаСчетаДепо
	|			ТОГДА ПОДСТРОКА(ВЫРАЗИТЬ(Документы.СчетДепо КАК Справочник.СчетаДепоМХ).Код, 1, 2) + ВЫБОР
	|					КОГДА НЕ Документы.Ссылка.ДокументОснование.Депонент ЕСТЬ NULL 
	|						ТОГДА ВЫБОР
	|								КОГДА Документы.Ссылка.ДокументОснование.РазделСубклиента = ИСТИНА
	|									ТОГДА ПОДСТРОКА(ВЫРАЗИТЬ(Документы.Ссылка.ДокументОснование.Депонент КАК Справочник.Контрагенты).Код, 4, 4) + Документы.Ссылка.ДокументОснование.Субклиент.Код
	|								ИНАЧЕ ПОДСТРОКА(ВЫРАЗИТЬ(Документы.Ссылка.ДокументОснование.Депонент КАК Справочник.Контрагенты).Код, 1, 7)
	|							КОНЕЦ
	|					ИНАЧЕ ""0000000""
	|				КОНЕЦ
	|		ИНАЧЕ ВЫРАЗИТЬ(Документы.СчетДепо КАК Справочник.СчетаДепо).Владелец.Код
	|	КОНЕЦ КАК КодДепонента,
	|	Документы.ЦБ КАК ЦеннаяБумага,
	|	ЕСТЬNULL(Документы.ЦБ.ISIN, """") КАК ISIN,
	|	ЕСТЬNULL(КодыЗагрузкиЦБ.Код, """") КАК КодЦБ,
	|	ВЫБОР
	|		КОГДА Документы.ВидОперации = &ПереводМеждуРазделамиСчетаДепо
	|			ТОГДА ""20""
	|		КОГДА Документы.ВидОперации = &Перемещение
	|			ТОГДА ""10""
	|		КОГДА Документы.ВидОперации = &ОткрытиеРазделаСчетаДепо
	|			ТОГДА ""90""
	|		КОГДА Документы.СчетДепоКонтрагента.ПризнакСчетаДепо = &СчетКонтрагента
	|				ИЛИ Документы.СчетДепоКонтрагента = &ПустойСчетДепо
	|			ТОГДА ВЫБОР
	|					КОГДА Документы.МХКонтрагент = &МестоХранения
	|						ТОГДА ВЫБОР Документы.ВидОперации
	|								КОГДА &СнятиеСДепонирования
	|									ТОГДА ВЫБОР
	|											КОГДА Документы.СуммаСделки = 0
	|												ТОГДА ""16""
	|											ИНАЧЕ ""19/0""
	|										КОНЕЦ
	|								КОГДА &Депонирование
	|									ТОГДА ВЫБОР
	|											КОГДА Документы.СуммаСделки = 0
	|												ТОГДА ""16/1""
	|											ИНАЧЕ ""19/1""
	|										КОНЕЦ
	|								ИНАЧЕ """"
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР Документы.ВидОперации
	|							КОГДА &СнятиеСДепонирования
	|								ТОГДА ""36""
	|							КОГДА &Депонирование
	|								ТОГДА ""37""
	|							ИНАЧЕ """"
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодОперации,
	|	Документы.МХКонтрагент.Код КАК МХКонтрагентКод,
	|	Документы.ПланируемаяДатаРасчетов КАК ПланируемаяДатаРасчетов,
	|	Документы.СуммаСделки КАК СуммаСделки,
	|	ЕСТЬNULL(Документы.БанковскийСчет.ВалютаДенежныхСредств, &ПустаяВалюта) КАК ВалютаБанковскогоСчета,
	|	Документы.ДатаСделки КАК ДатаСделки,
	|	ВЫРАЗИТЬ(Документы.Контрагент.ЮридическиеФизическиеЛица КАК Справочник.ЮридическиеЛица).Страна.КодАльфа2 КАК КодАльфа2СтраныЮрлицаКонтрагента,
	|	ВЫБОР
	|		КОГДА Документы.ВидОперации = &ОткрытиеРазделаСчетаДепо
	|			ТОГДА ВЫРАЗИТЬ(Документы.СчетДепо КАК Справочник.СчетаДепоМХ)
	|		ИНАЧЕ ВЫРАЗИТЬ(Документы.СчетДепо КАК Справочник.СчетаДепо)
	|	КОНЕЦ КАК СчетДепо,
	|	ВЫРАЗИТЬ(Документы.СчетДепо КАК Справочник.СчетаДепо).НомерДепозитарногоДоговора КАК НомерДепозитарногоДоговора,
	|	ЕСТЬNULL(Документы.СчетДепоКонтрагента.НомерДепозитарногоДоговора, """") КАК НомерДепозитарногоДоговораКонтрагента,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Документы.ВидОперации = &ОткрытиеРазделаСчетаДепо
	|				ТОГДА Документы.СчетДепо.Код
	|			ИНАЧЕ Документы.СчетДепоМХ.Код
	|		КОНЕЦ, """") КАК СчетДепоМХКод,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Документы.ВидОперации = &ОткрытиеРазделаСчетаДепо
	|				ТОГДА Документы.РазделСчетаДепоМХ
	|			ИНАЧЕ Документы.РазделСчетаДепоМХ.Код
	|		КОНЕЦ, """") КАК РазделСчетаДепоМХКод,
	|	ЕСТЬNULL(Документы.СчетДепоКонтрагента, &ПустойСчетДепо) КАК СчетДепоКонтрагента,
	|	ЕСТЬNULL(Документы.СчетДепоКонтрагента.Код, """") КАК СчетДепоКонтрагентаКод,
	|	ЕСТЬNULL(Документы.РазделСчетаДепоКонтрагента.Код, """") КАК РазделСчетаДепоКонтрагентаКод,
	|	ЕСТЬNULL(Документы.РазделСчетаДепоКонтрагента.КраткийКодНРД, """") КАК РазделСчетаДепоКонтрагентаКраткийКодНРД,
	|	ЕСТЬNULL(Документы.БанковскийСчет.НомерСчета, """") КАК НомерБанковскогоСчета,
	|	ЕСТЬNULL(Документы.БанковскийСчет.Банк.SWIFT, """") КАК SWIFTБанка,
	|	Документы.КоличествоЦБ КАК КоличествоЦБ,
	|	Документы.КраткийКодНРД КАК КраткийКодНРД,
	|	Документы.Референс КАК Референс,
	|	Документы.РазделСчетаДепоКраткийКодНРД КАК РазделСчетаДепоКраткийКодНРД,
	|	ВЫБОР
	|		КОГДА &ВыгрузитьБезусловно
	|				ИЛИ Документы.ПоручениеВВышестоящийДепозитарий ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КВыгрузке,
	|	ВЫБОР
	|		КОГДА НЕ Документы.ПоручениеВВышестоящийДепозитарий ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Выгружен,
	|	Документы.РазделСчетаДепоМХКонтрагентаКод КАК РазделСчетаДепоМХКонтрагентаКод,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК СтатусФШ
	|ИЗ
	|	втДокументыДляОбработки КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЦБ
	|		ПО ((ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Владелец КАК Справочник.ЦенныеБумаги)) = Документы.ЦБ)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиЦБ.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (НЕ КодыЗагрузкиЦБ.ПометкаУдаления)
	|			И (КодыЗагрузкиЦБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиЦБ.ДатаОкончанияДействия > НАЧАЛОПЕРИОДА(Документы.Дата, ДЕНЬ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКонтрагента
	|		ПО ((ВЫРАЗИТЬ(КодыЗагрузкиКонтрагента.Владелец КАК Справочник.Контрагенты)) = Документы.Контрагент)
	|			И ((ВЫРАЗИТЬ(КодыЗагрузкиКонтрагента.Биржа КАК Справочник.КлассификаторыЗагрузки)) = &НДЦ)
	|			И (НЕ КодыЗагрузкиКонтрагента.ПометкаУдаления)
	|			И (КодыЗагрузкиКонтрагента.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ КодыЗагрузкиКонтрагента.ДатаОкончанияДействия > НАЧАЛОПЕРИОДА(Документы.Дата, ДЕНЬ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних(, ) КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|		ПО СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ В (ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.ТехническаяОперация ГДЕ ДОкументОснование = Документы.Ссылка УПОРЯДОЧИТЬ ПО Дата УБЫВ)
	|
	|ГДЕ 
   	|	ЕСТЬNULL(СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовФайловыйШлюз.ВыгрузитьФайловыйШлюз)) В (&МассивСтатусовКВыгрузке)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.Дата,
	|	Документы.Номер";
КонецФункции

// Возвращает структуру с описанием ошибки, если она обнаружена. Иначе - неопределено.
// Параметры:
//	Данные - СтрокаТабличнойЧасти - Строка ТЧ Поручения этой обработки
//	КодЗагрузкиОрганизации - Строка
//	ПутьДляВыгрузки - Строка
// Возвращаемое значение:
//	- Структура
Функция РезультатФормированияПакетаXML(Данные, КодЗагрузкиОрганизации, ПутьДляВыгрузки)
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	
	НачатьТранзакцию();
	ТекущаяДата = ТекущаяДатаСеанса();
	ПовторнаяВыгрузка = Данные.Выгружен;
	Если ПовторнаяВыгрузка Тогда
		РеквизитыВыгрузки		= РегистрыСведений.ДокументыВыгруженныеВЛуч.РеквизитыВыгрузки(Данные.Поручение);
		ИсходящийНомер			= РеквизитыВыгрузки.ИсходящийНомер;
		РегистрационныйНомер	= РеквизитыВыгрузки.РегистрационныйНомер;
	Иначе
		НовыйПорядковыйНомер	= РегистрыСведений.ДокументыВыгруженныеВЛуч.НовыйПорядковыйНомерВТечениеДня(ТекущаяДата);
		Если НовыйПорядковыйНомер = 0 Тогда
			ОтменитьТранзакцию();
			Ошибка.СообщениеВЖурнал = "Не удалось получить новый порядковый номер за " + Формат(ТекущаяДата, "ДЛФ=Д");
			Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
			Возврат Ошибка;
		КонецЕсли;
		ПозицияПервойЦифры = 2;
		Если ПустаяСтрока(Данные.КодДепонента) Тогда
			ИсходящийНомер = "D" + Сред(Данные.Номер, ПозицияПервойЦифры, СтрНайти(Данные.Номер, "-") - ПозицияПервойЦифры);
		Иначе
			ИсходящийНомер = СокрЛП(Данные.КодДепонента);
		КонецЕсли;
		ИсходящийНомер = ИсходящийНомер + "-" + Формат(НовыйПорядковыйНомер, "ЧЦ=4;ЧВН=1;ЧГ=0;");
		РегистрационныйНомер = "";
	КонецЕсли;
	
	ИмяФайлаXML = ПутьДляВыгрузки + "\" + ДопустимыеСимволы(СокрЛП(Данные.Номер)) + "_" + ИсходящийНомер + ".xml";

	ЗаписьXML = Новый ЗаписьXML;
	Попытка
		ЗаписьXML.ОткрытьФайл(ИмяФайлаXML, "windows-1251");
	Исключение
		ОтменитьТранзакцию();
		Ошибка.СообщениеВЖурнал = "Не удалось открыть файл " + ИмяФайлаXML;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал;
		Возврат Ошибка;
	КонецПопытки;	
	
	Ошибка = РезультатЗаполненияXML(ЗаписьXML, Данные, КодЗагрузкиОрганизации, ИсходящийНомер);
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ОтменитьТранзакцию();
		Возврат Ошибка;
	КонецЕсли;
	
	ЗаписьXML.Закрыть();
	
	РегистрыСведений.ДокументыВыгруженныеВЛуч.ДобавитьДокумент(Данные.Поручение, ТекущаяДата, ИсходящийНомер, РегистрационныйНомер, ПараметрыСеанса.ТекущийПользователь);
	
	ЗафиксироватьТранзакцию();
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает структуру с описанием ошибки, если она обнаружена. Иначе - неопределено.
// Возвращаемое значение:
//	- Структура
Функция РезультатФормированияПакетаXML_ФШ(Данные, КодЗагрузкиОрганизации)
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	
	НачатьТранзакцию();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("Windows-1251");
	
	ИсходящийНомер = Обработки.ЭкспортПорученийВЛуч.ФорматИсходящегоНомера(Данные.Номер);
	Ошибка = РезультатЗаполненияXML(ЗаписьXML, Данные, КодЗагрузкиОрганизации, ИсходящийНомер);
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ОтменитьТранзакцию();
		Возврат Ошибка;
	КонецЕсли;
	
	ТекстДокумента = ЗаписьXML.Закрыть();
	
	Ошибка = Обработки.ЭкспортПорученийВЛуч.СформироватьИсходящийПакетВФайловыйШлюз(ИсходящийНомер, Данные.Дата, ТипОперации(Данные.КодОперации), Данные.КодОперации, Данные.Поручение, ТекстДокумента);
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ОтменитьТранзакцию();
		Возврат Ошибка;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Неопределено;
	
КонецФункции

Функция ТипОперации(КодОперации)
	Если КодОперации = "16/1" ИЛИ КодОперации = "16" ИЛИ КодОперации = "10" Тогда
		Возврат "MF010";
		
	ИначеЕсли КодОперации = "19/1" ИЛИ КодОперации = "19/0" Тогда
		Возврат "MF190";
		
	ИначеЕсли КодОперации = "37" Тогда
		Возврат "MF035";
		
	ИначеЕсли КодОперации = "36" Тогда
		Возврат "MF036";
		
	ИначеЕсли КодОперации = "20" Тогда
		Возврат "MF020";
		
	ИначеЕсли КодОперации = "90" Тогда
		Возврат "AF090";
		
	КонецЕсли;
КонецФункции // ()
 
Функция РезультатЗаполненияXML(ЗаписьXML, Данные, КодЗагрузкиОрганизации, ИсходящийНомер)
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// {{ Batch
	ЗаписьXML.ЗаписатьНачалоЭлемента("Batch");
	ЗаписатьЭлементXML(ЗаписьXML, "Documents_amount", 1);
	
	НомерВерсии = НомерВерсии(Данные.КодОперации);
	Если Не ЗначениеЗаполнено(НомерВерсии) Тогда
		Ошибка.СообщениеВЖурнал = "Не удалось определить номер версии для кода операции " + Данные.КодОперации;
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + Данные.Поручение;
		Ошибка.СообщениеВЖурнал = Ошибка.СообщениеВЖурнал;
		Ошибка.Данные = Данные.Поручение;
		Возврат Ошибка;
	КонецЕсли;
	
	// {{ Document
	ЗаписьXML.ЗаписатьНачалоЭлемента("Document");
	ЗаписьXML.ЗаписатьАтрибут("DOC_ID", "1");
	ЗаписьXML.ЗаписатьАтрибут("version", НомерВерсии);
	
	// {{ ORDER_HEADER
	ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_HEADER");
	// Код депозитария-получателя поручения (ставим значение по-умолчанию)
	ЗаписатьЭлементXML(ЗаписьXML, "deposit_c",	"NDC000000000");
	// Код инициатора поручения
	ЗаписатьЭлементXML(ЗаписьXML, "contrag_c",	КодЗагрузкиОрганизации);
	// Исходящий номер документа
	ЗаписатьЭлементXML(ЗаписьXML, "contr_d_id",	ИсходящийНомер);
	// Дата формирования документа
	ЗаписатьЭлементXML(ЗаписьXML, "createdate",	ФорматДаты(Данные.Дата));
	// Код операции
	ЗаписатьЭлементXML(ЗаписьXML, "order_t_id",	Данные.КодОперации);
	// Дата исполнения поручения
	ЗаписатьЭлементXML(ЗаписьXML, "execute_dt",	ДатаИсполненияПоручения(Данные));
	// Дата истечения срока исполнения поручения
	ЗаписатьЭлементXML(ЗаписьXML, "expirat_dt",	ДатаИстеченияСрокаИсполненияПоручения(Данные));
	// }} ORDER_HEADER
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	Если Данные.КодОперации = "16/1" Тогда
		Ошибка = РезультатЗаписиXMLЗачислениеМеждуСчетамиДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
		
	ИначеЕсли Данные.КодОперации = "16" Тогда
		Ошибка = РезультатЗаписиXMLСписаниеМеждуСчетамиДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
		
	ИначеЕсли Данные.КодОперации = "19/1" Тогда
		Ошибка = РезультатЗаписиXMLЗачислениеМеждуСчетамиДепоССуммойСделки(ЗаписьXML, Данные);
		
	ИначеЕсли Данные.КодОперации = "19/0" Тогда
		Ошибка = РезультатЗаписиXMLСписаниеМеждуСчетамиДепоССуммойСделки(ЗаписьXML, Данные);
		
	ИначеЕсли Данные.КодОперации = "37" Тогда
		Ошибка = РезультатЗаписиXMLЗачислениеИзДругогоДепозитария(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
		
	ИначеЕсли Данные.КодОперации = "36" Тогда
		Ошибка = РезультатЗаписиXMLСписаниеВДругойДепозитарий(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
		
	ИначеЕсли Данные.КодОперации = "10" Тогда
		Ошибка = РезультатЗаписиXMLПереводМеждуСчетамиДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
		
	ИначеЕсли Данные.КодОперации = "20" Тогда
		Ошибка = РезультатЗаписиXMLПереводМеждуРазделамиПоОдномуСчетуДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
		
	ИначеЕсли Данные.КодОперации = "90" Тогда
		Ошибка = РезультатЗаписиXMLОткрытиеРазделаСчетаМХ(ЗаписьXML, Данные);
		
	Иначе
		Ошибка.СообщениеВЖурнал = "Не удалось определить код операции поручения";
		ДопРасшифровка = "Счет депо в разделе 'Контрагент' может быть не указан или должен иметь признак 'Счет контрагента'";
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + Данные.Поручение + Символы.ПС
			+ ДопРасшифровка;
		Ошибка.СообщениеВЖурнал = Ошибка.СообщениеВЖурнал + Символы.ПС + ДопРасшифровка;
		Ошибка.Данные = Данные.Поручение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	
	// }} Document
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// }} Batch
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьЭлементXML(ЗаписьXML, Тег, Значение)
	ЗаписьXML.ЗаписатьНачалоЭлемента(Строка(Тег));						// Начало элемента
	ЗаписьXML.ЗаписатьТекст(СтрЗаменить(Строка(Значение), " ", ""));	// Значение элемента
	ЗаписьXML.ЗаписатьКонецЭлемента();									// Конец элемента
КонецПроцедуры

Функция ДопустимыеСимволы(СтрокаНаПроверку)
	Результат = СтрЗаменить(СтрокаНаПроверку, "Д", "D");
	Возврат Результат;
КонецФункции

// Поиск кода участника фондового рынка по владельцу
// Возвращаемое значение:
//	- Строка
Функция КодУчастникаФондовогоРынка(ВладелецКода)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыЗагрузки.Код
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец = &Владелец
	|	И КодыЗагрузки.Биржа = &Биржа
	|	И НЕ КодыЗагрузки.ПометкаУдаления";
	Запрос.УстановитьПараметр("Биржа",		Константы.КлассификаторЗагрузкиУчастники.Получить());
	Запрос.УстановитьПараметр("Владелец",	ВладелецКода);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.Код);
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Процедура ЗаписатьЭлементыXMLДанныеОтправителяПриДепонировании(ЗаписьXML, Данные, КодЗагрузкиОрганизации)
	Если Данные.КодОперации = "37" Тогда
		deponent_c	= КодЗагрузкиОрганизации;
		dep_acc_c	= СокрЛП(Данные.СчетДепоМХКод);
		sec_c		= СокрЛП(Данные.РазделСчетаДепоМХКод);
	Иначе
		deponent_c	= СокрЛП(Данные.КонтрагентКод);
		dep_acc_c	= СокрЛП(Данные.СчетДепоКонтрагентаКод);
		sec_c		= СокрЛП(Данные.РазделСчетаДепоКонтрагентаКод);
	КонецЕсли;
	ЗаписатьЭлементXML(ЗаписьXML, "deponent_c",	deponent_c);	// Отправитель
	ЗаписатьЭлементXML(ЗаписьXML, "dep_acc_c",	dep_acc_c);		// Отправитель - Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c",		sec_c);			// Отправитель - Раздел счета депо
КонецПроцедуры

Процедура ЗаписатьЭлементыXMLДанныеПолучателяПриСнятииСДепонирования(ЗаписьXML, Данные)
	КодУчастникаФР	= КодУчастникаФондовогоРынка(Данные.Контрагент);
	ЗаписатьЭлементXML(ЗаписьXML, "corr_code",	?(ЗначениеЗаполнено(КодУчастникаФР), КодУчастникаФР,
		СокрЛП(Данные.КонтрагентКод)));															// Получатель
	ЗаписатьЭлементXML(ЗаписьXML, "corr_acc_c",	СокрЛП(Данные.СчетДепоКонтрагентаКод));			// Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_c",	СокрЛП(Данные.РазделСчетаДепоКонтрагентаКод));	// Раздел счета депо
КонецПроцедуры

Функция РезультатЗаписиXMLЗачислениеМеждуСчетамиДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации)
	// {{ MF010
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF010");
	
	ЗаписатьЭлементыXMLДанныеОтправителяПриДепонировании(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
	
	ЗаписатьЭлементXML(ЗаписьXML, "corr_acc_c",	СокрЛП(Данные.СчетДепоМХКод));			// Счет депо получателя
	ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_c",	СокрЛП(Данные.РазделСчетаДепоМХКод));	// Раздел счета депо получателя
	ЗаписатьЭлементXML(ЗаписьXML, "corr_code",	КодЗагрузкиОрганизации);				// Получатель
	
	ЗаписатьЭлементыXMLДепозитарныйДоговор(ЗаписьXML, Данные);
	
	// {{ Электронный Matching в НРД
	Если ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагентаКраткийКодНРД)
		ИЛИ ЗначениеЗаполнено(Данные.КраткийКодНРД) Тогда
		section_id = ?(ЗначениеЗаполнено(Данные.КраткийКодНРД), Данные.КраткийКодНРД,
			Данные.РазделСчетаДепоКонтрагентаКраткийКодНРД);
		ЗаписатьЭлементXML(ЗаписьXML, "section_id", СокрЛП(section_id));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.РазделСчетаДепоКраткийКодНРД) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_id", СокрЛП(Данные.РазделСчетаДепоКраткийКодНРД));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.Референс) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "deal_reference", СокрЛП(Данные.Референс));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ДатаСделки) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "date_deal", ФорматДаты(Данные.ДатаСделки));
	КонецЕсли;
	// }} Электронный Matching в НРД
	
	Ошибка = РезультатЗаписиXMLЦенныеБумагиСУчетомISIN(ЗаписьXML, Данные);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	
	// }} MF010
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Процедура ЗаписатьЭлементыXMLДепозитарныйДоговор(ЗаписьXML, Данные);
	ДепозитарныйДоговор		= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ДепозитарныеДоговоры	= Справочники.ДоговорыКонтрагентов.Выбрать(, Данные.Депонент);
	Пока ДепозитарныеДоговоры.Следующий() Цикл
		Если ЗначениеЗаполнено(ДепозитарныеДоговоры.ДатаОкончанияДействия)
			И (ДепозитарныеДоговоры.ДатаОкончанияДействия < Данные.Дата) Тогда
			Продолжить;
		Иначе
			ДепозитарныйДоговор = ДепозитарныеДоговоры.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ДепозитарныйДоговор.Пустая() Тогда
		// Основание (депозитарный договор)
		ЗаписатьЭлементXML(ЗаписьXML, "based_on",	"Депозитарный договор");
		// Номер документа-основания
		ЗаписатьЭлементXML(ЗаписьXML, "based_numb",	СокрЛП(ДепозитарныйДоговор.Код));
		Если ЗначениеЗаполнено(ДепозитарныйДоговор.ДатаНачалоДействия) Тогда
			// Дата документа основания
			ЗаписатьЭлементXML(ЗаписьXML, "based_date", ФорматДаты(ДепозитарныйДоговор.ДатаНачалоДействия));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция РезультатЗаписиXMLЗачислениеИзДругогоДепозитария(ЗаписьXML, Данные, КодЗагрузкиОрганизации)
	// {{ MF035
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF035");
	// Заполняем информацию по отправителю
	ЗаписатьЭлементыXMLДанныеОтправителяПриДепонировании(ЗаписьXML, Данные, КодЗагрузкиОрганизации);
	// SWIFT код стороннего депозитария
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.БИКМестаРасчетов) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "reestr_bic", СокрЛП(Данные.СчетДепоКонтрагента.БИКМестаРасчетов));
	КонецЕсли;	
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.КодМестаРасчетов) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "reestr_cod", СокрЛП(Данные.СчетДепоКонтрагента.КодМестаРасчетов));
	КонецЕсли;
	
	// Отправитель
	//
	
	// BIC/BEI отправителя
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
		И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.БикОтправителя) Тогда
		person_bic = Данные.СчетДепоКонтрагента.БикОтправителя;
	Иначе
		person_bic = Данные.БикКлиентаДепозитария;
	КонецЕсли;
	Если ЗначениеЗаполнено(person_bic) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "person_bic",	СокрЛП(person_bic));
	КонецЕсли; 
	
	// Полное имя отправителя
	Если Не ЗначениеЗаполнено(person_bic) Тогда // полное имя заполняем только если нет BIC/BEI
		Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
			И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНаименование) Тогда
			full_name = Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНаименование;
		Иначе
			Если ЗначениеЗаполнено(Данные.ПолноеНаименованиеКонтрагента) Тогда
				full_name = Данные.ПолноеНаименованиеКонтрагента;
			Иначе
				full_name = Данные.НаименованиеКонтрагента;
			КонецЕсли;
		КонецЕсли;
		ЗаписатьЭлементXML(ЗаписьXML, "full_name", СокрЛП(full_name));
	КонецЕсли;
	
	// Счет депо получателя
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
		И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчета) Тогда
		sr_acc_c = Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчета;
	Иначе
		sr_acc_c = Данные.СчетДепоКонтрагентаКод;
	КонецЕсли;
	ЗаписатьЭлементXML(ЗаписьXML, "sr_acc_c", СокрЛП(sr_acc_c));
	
	ЗаписатьЭлементыXMLИнформацияОСчетеВМестеРасчетов(ЗаписьXML, Данные);
	
	// Операция иcполнена/не исполнена
	ЗаписатьЭлементXML(ЗаписьXML, "oper_mark", "N");
	// Дата операции
	ЗаписатьЭлементXML(ЗаписьXML, "oper_date", ФорматДаты(Данные.ПланируемаяДатаРасчетов));
	// Дата сделки
	Если ЗначениеЗаполнено(Данные.ДатаСделки) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "trad_dt", ФорматДаты(Данные.ДатаСделки));
	КонецЕсли;
	// Нужно встречное поручение
	ЗаписатьЭлементXML(ЗаписьXML, "need_cvit", "Y");
	// Оплата операции в месте расчетов получателем
	ЗаписатьЭлементXML(ЗаписьXML, "reciv_payment", "N");
	// Код ЦБ в НДЦ
	Если ЗначениеЗаполнено(Данные.КодЦБ) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "security_c", СокрЛП(Данные.КодЦБ));
	Иначе
		Возврат ОшибкаПустойКодЗагрузкиЦеннойБумаги(Данные);
	КонецЕсли;
	// Количество ЦБ
	ЗаписатьЭлементXML(ЗаписьXML, "security_q", ФорматКоличества(Данные.КоличествоЦБ));
	
	Если Данные.СуммаСделки <> 0 Тогда
		Ошибка = РезультатЗаписиXMLAddInforms(ЗаписьXML, Данные);
		Если ЗначениеЗаполнено(Ошибка) Тогда
			Возврат Ошибка;
		КонецЕсли;
		Ошибка = РезультатЗаписиXMLСуммаСделкиВалюта(ЗаписьXML, Данные);
		Если ЗначениеЗаполнено(Ошибка) Тогда
			Возврат Ошибка;
		КонецЕсли;
	КонецЕсли;
	Ошибка = РезультатЗаписиXMLПодтверждающиеДокументы(ЗаписьXML, Данные);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	// }} MF035
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLСписаниеМеждуСчетамиДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации)
	// {{ MF010
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF010");
	// Отправитель
	ЗаписатьЭлементXML(ЗаписьXML, "deponent_c",	КодЗагрузкиОрганизации);
	// Отправитель - Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "dep_acc_c",	СокрЛП(Данные.СчетДепоМХКод));
	// Отправитель - Раздел счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c",		СокрЛП(Данные.РазделСчетаДепоМХКод));
	// Заполняем информацию по получателю
	ЗаписатьЭлементыXMLДанныеПолучателяПриСнятииСДепонирования(ЗаписьXML, Данные);
	Если ЗначениеЗаполнено(Данные.НомерДепозитарногоДоговораКонтрагента) Тогда
		// Основание (депозитарный договор)
		ЗаписатьЭлементXML(ЗаписьXML, "based_on",	"Депозитарный договор");
		// Номер документа-основания
		ЗаписатьЭлементXML(ЗаписьXML, "based_numb",	СокрЛП(Данные.НомерДепозитарногоДоговораКонтрагента));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.ДатаЗаключенияДепозитарногоДоговора) Тогда
		// Дата документа основания
		ЗаписатьЭлементXML(ЗаписьXML, "based_date", ФорматДаты(
			Данные.СчетДепоКонтрагента.ДатаЗаключенияДепозитарногоДоговора));
	КонецЕсли;
	
	// {{ Электронный Matching в НРД
	Если ЗначениеЗаполнено(Данные.РазделСчетаДепоКраткийКодНРД) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "section_id", СокрЛП(Данные.РазделСчетаДепоКраткийКодНРД));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.РазделСчетаДепоКонтрагентаКраткийКодНРД)
		ИЛИ ЗначениеЗаполнено(Данные.КраткийКодНРД) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_id", СокрЛП(?(ЗначениеЗаполнено(Данные.КраткийКодНРД),
			Данные.КраткийКодНРД, Данные.РазделСчетаДепоКонтрагентаКраткийКодНРД)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.Референс) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "deal_reference", СокрЛП(Данные.Референс));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ДатаСделки) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "date_deal", ФорматДаты(Данные.ДатаСделки));
	КонецЕсли;
	// }} Электронный Matching в НРД
	
	Ошибка = РезультатЗаписиXMLЦенныеБумагиСУчетомISIN(ЗаписьXML, Данные);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	
	// }} MF010
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLСписаниеМеждуСчетамиДепоССуммойСделки(ЗаписьXML, Данные)
	// {{ MF190
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF190");
	// Отправитель - Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "dep_acc_c",	СокрЛП(Данные.СчетДепоМХКод));
	// Отправитель - Раздел счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c",		СокрЛП(Данные.РазделСчетаДепоМХКод));
	// Получатель - Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "corr_acc_c",	СокрЛП(Данные.СчетДепоКонтрагентаКод));
	// Получатель - Раздел счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_c",	СокрЛП(Данные.РазделСчетаДепоКонтрагентаКод));
	// Дата сделки
	ЗаписатьЭлементXML(ЗаписьXML, "deal_date",	ФорматДаты(Данные.ДатаСделки));
	// Код загрузки получателя
	Если ЗначениеЗаполнено(Данные.КодЗагрузкиКонтрагента) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "con_code", СокрЛП(Данные.КодЗагрузкиКонтрагента));
	Иначе
		Возврат ОшибкаПустойКодЗагрузкиКонтрагента(Данные);
	КонецЕсли;	
	// Тип сделки	
	ЗаписатьЭлементXML(ЗаписьXML, "deal_type",	"DVP2");
	// Номер банковского счета-получателя
	ЗаписатьЭлементXML(ЗаписьXML, "rec_acc",	СокрЛП(Данные.НомерБанковскогоСчета));
	// SWIFT-код банка-получателя
	ЗаписатьЭлементXML(ЗаписьXML, "rec_bic",	СокрЛП(Данные.SWIFTБанка));
	// Сумма поручения
	ЗаписатьЭлементXML(ЗаписьXML, "pay_sum",	Формат(Данные.СуммаСделки, "ЧГ=;ЧРД=."));
	// Валюта поручения
	Если ЗначениеЗаполнено(Данные.ВалютаБанковскогоСчета) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "pay_curr", Справочники.Валюты.ПредставлениеВалюты(Данные.ВалютаБанковскогоСчета));
	Иначе
		Возврат ОшибкаПустаяВалютаБанковскогоСчета(Данные);
	КонецЕсли;	
	// Константа
	ЗаписатьЭлементXML(ЗаписьXML, "carry_sel_sec",	"N");	
	Ошибка = ЗаписатьЭлементыXMLЦенныеБумаги(ЗаписьXML, Данные);	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;	
	// }} MF190
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLЗачислениеМеждуСчетамиДепоССуммойСделки(ЗаписьXML, Данные)
	// {{ MF190
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF190");	
	// Отправитель - Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "dep_acc_c",	СокрЛП(Данные.СчетДепоКонтрагентаКод));
	// Отправитель - Раздел счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c",		СокрЛП(Данные.РазделСчетаДепоКонтрагентаКод));	
	// Получатель - Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "corr_acc_c",	СокрЛП(Данные.СчетДепоМХКод));
	// Получатель - Раздел счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_c",	СокрЛП(Данные.РазделСчетаДепоМХКод));	
	// Дата сделки
	ЗаписатьЭлементXML(ЗаписьXML, "deal_date",	ФорматДаты(Данные.ДатаСделки));
	// Код загрузки получателя
	Если ЗначениеЗаполнено(Данные.КодЗагрузкиКонтрагента) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "con_code", СокрЛП(Данные.КодЗагрузкиКонтрагента));
	Иначе
		Возврат ОшибкаПустойКодЗагрузкиКонтрагента(Данные);
	КонецЕсли;	
	// Тип сделки	
	ЗаписатьЭлементXML(ЗаписьXML, "reserv_money",	"Y");
	// Тип сделки	
	ЗаписатьЭлементXML(ЗаписьXML, "deal_type",	"DVP2");
	// Номер банковского счета-отправителя
	ЗаписатьЭлементXML(ЗаписьXML, "sen_acc",	СокрЛП(Данные.НомерБанковскогоСчета));
	// SWIFT-код банка-отправителя
	ЗаписатьЭлементXML(ЗаписьXML, "sen_bic",	СокрЛП(Данные.SWIFTБанка));
	// Сумма поручения
	ЗаписатьЭлементXML(ЗаписьXML, "pay_sum",	ФорматКоличества(Данные.СуммаСделки));
	// Валюта поручения
	Если ЗначениеЗаполнено(Данные.ВалютаБанковскогоСчета) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "pay_curr", Справочники.Валюты.ПредставлениеВалюты(Данные.ВалютаБанковскогоСчета));
	Иначе
		Возврат ОшибкаПустаяВалютаБанковскогоСчета(Данные);
	КонецЕсли;
	Ошибка = ЗаписатьЭлементыXMLЦенныеБумаги(ЗаписьXML, Данные);	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	// }} MF190
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLСписаниеВДругойДепозитарий(ЗаписьXML, Данные, КодЗагрузкиОрганизации)
	// {{ MF036
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF036");
	// Отправитель
	ЗаписатьЭлементXML(ЗаписьXML, "deponent_c",	КодЗагрузкиОрганизации);
	// Отправитель - Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "dep_acc_c",	СокрЛП(Данные.СчетДепоМХКод));
	// Отправитель - Раздел счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c",		СокрЛП(Данные.РазделСчетаДепоМХКод));
	// SWIFT код стороннего депозитария
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.БИКМестаРасчетов) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "reestr_bic", СокрЛП(Данные.СчетДепоКонтрагента.БИКМестаРасчетов));
	КонецЕсли;	
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.КодМестаРасчетов) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "reestr_cod", СокрЛП(Данные.СчетДепоКонтрагента.КодМестаРасчетов));
	КонецЕсли;
	// Тип счета
	ЗаписатьЭлементXML(ЗаписьXML, "acc_type",	Справочники.СчетаДепо.КодТипаСчетаДЕПО(Данные.СчетДепоКонтрагента.ТипСчетаДепо));
	// Юр./физ. лицо (получатель)
	ЗаписатьЭлементXML(ЗаписьXML, "pr_jur_or_ind",	Данные.ЮрФизЛицо);
	
	// Получатель
	//
	
	// BIC/BEI получателя
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
		И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.БикОтправителя) Тогда
		person_bic = Данные.СчетДепоКонтрагента.БикОтправителя;
	Иначе
		person_bic = Данные.БикКлиентаДепозитария;
	КонецЕсли;
	Если ЗначениеЗаполнено(person_bic) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "person_bic",	СокрЛП(person_bic));
	КонецЕсли; 
	
	// Полное имя получателя
	Если НЕ ЗначениеЗаполнено(person_bic) Тогда // полное имя заполняем только если нет BIC/BEI
		Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
			И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНаименование) Тогда
			full_name = Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНаименование;
		Иначе	
			full_name = Данные.НаименованиеКонтрагента;
		КонецЕсли;
		ЗаписатьЭлементXML(ЗаписьXML, "full_name", СокрЛП(full_name));
	КонецЕсли;
	
	// Дата операции
	ЗаписатьЭлементXML(ЗаписьXML, "oper_date",	ФорматДаты(Данные.ПланируемаяДатаРасчетов));
	// Дата сделки
	Если ЗначениеЗаполнено(Данные.ДатаСделки) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "trad_dt", ФорматДаты(Данные.ДатаСделки));
	КонецЕсли;
	// Код ЦБ в НДЦ
	Если ЗначениеЗаполнено(Данные.КодЦБ) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "security_c",	СокрЛП(Данные.КодЦБ));
	Иначе
		Возврат ОшибкаПустойКодЗагрузкиЦеннойБумаги(Данные);
	КонецЕсли;
	// Количество ЦБ
	ЗаписатьЭлементXML(ЗаписьXML, "security_q",	ФорматКоличества(Данные.КоличествоЦБ));
	
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
		И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчета) Тогда
		recv_acc_c = Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчета;
	Иначе
		recv_acc_c = Данные.СчетДепоКонтрагентаКод;
	КонецЕсли;
	ЗаписатьЭлементXML(ЗаписьXML, "recv_acc_c",	СокрЛП(recv_acc_c));
	
	ЗаписатьЭлементыXMLИнформацияОСчетеВМестеРасчетов(ЗаписьXML, Данные);
	
	ЗаписатьЭлементXML(ЗаписьXML, "need_cvit",	"Y");
	
	Если Данные.СуммаСделки <> 0 Тогда
		Ошибка = РезультатЗаписиXMLAddInforms(ЗаписьXML, Данные);
		Если ЗначениеЗаполнено(Ошибка) Тогда
			Возврат Ошибка;
		КонецЕсли;
		Ошибка = РезультатЗаписиXMLСуммаСделкиВалюта(ЗаписьXML, Данные);
		Если ЗначениеЗаполнено(Ошибка) Тогда
			Возврат Ошибка;
		КонецЕсли;
	КонецЕсли;
	Ошибка = РезультатЗаписиXMLПодтверждающиеДокументы(ЗаписьXML, Данные);	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	// }} MF036
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция ДатаИсполненияПоручения(Данные)
	Если Данные.КодОперации = "37"
			ИЛИ Данные.КодОперации = "36"
			ИЛИ Данные.КодОперации = "19/0"
			ИЛИ Данные.КодОперации = "19/1" Тогда
		execute_dt = Данные.ПланируемаяДатаРасчетов;
	Иначе
		execute_dt = Данные.Дата;
	КонецЕсли;
	
	Возврат Формат(НачалоДня(execute_dt), "ДФ=""гггг-ММ-дд ЧЧ:мм:сс""");
КонецФункции

Функция ДатаИстеченияСрокаИсполненияПоручения(Данные)
	Если Данные.КодОперации = "37"
			ИЛИ Данные.КодОперации = "36" Тогда
			//ИЛИ Данные.КодОперации = "19/0"
			//ИЛИ Данные.КодОперации = "19/1" Тогда
		expirat_dt = ДобавитьМесяц(Данные.ПланируемаяДатаРасчетов, 1);
	ИначеЕсли	Данные.КодОперации = "90" Тогда
		expirat_dt = Данные.Дата;
	ИначеЕсли Данные.КодОперации = "16" 
		  ИЛИ Данные.КодОперации = "16/1"
		  ИЛИ Данные.КодОперации = "19/0"
		  ИЛИ Данные.КодОперации = "19/1" Тогда
		ДнейВУсловномМесяце = 30;
		expirat_dt = НачалоДня(Данные.ПланируемаяДатаРасчетов) + ОбщегоНазначенияПовтИсп.СекундВСутках(ДнейВУсловномМесяце) - 1;
	Иначе
		expirat_dt = ОбщегоНазначения.ДобавитьРабочийДень(Данные.Дата, 3);
	КонецЕсли;
	
	Возврат Формат(КонецДня(expirat_dt), "ДФ=""гггг-ММ-дд ЧЧ:мм:сс""");
КонецФункции

Функция РезультатЗаписиXMLAddInforms(ЗаписьXML, Данные)
	
	ДопИнформация = РегистрыСведений.ПараметрыСделокДляЭкспортаВЛуч.ПараметрыДокумента(Данные.Поручение);
	Если ЗначениеЗаполнено(ДопИнформация) Тогда
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("add_informs");
		
		Для Каждого Параметр Из ДопИнформация Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("add_info");
			ЗаписатьЭлементXML(ЗаписьXML, "param_code", Параметр.Ключ);
			ЗаписатьЭлементXML(ЗаписьXML, "param_value", Параметр.Значение);
			ЗаписьXML.ЗаписатьКонецЭлемента(); // }} add_info
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // }} add_informs
		Возврат Неопределено;
			
	ИначеЕсли Не ЗначениеЗаполнено(Данные.КодАльфа2СтраныЮрлицаКонтрагента) Тогда
		Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
		Ошибка.СообщениеВЖурнал = "Не указан код страны 'Альфа-2' у юр.лица контрагента";
		Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + Данные.Контрагент;
		Ошибка.Данные = Данные.Контрагент;
		Возврат Ошибка;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("add_informs");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("add_info");
	ЗаписатьЭлементXML(ЗаписьXML, "param_code", "DVP");
	ЗаписатьЭлементXML(ЗаписьXML, "param_value", "DVP");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // }} add_info
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("add_info");
	ЗаписатьЭлементXML(ЗаписьXML, "param_code", "STRANA");
	ЗаписатьЭлементXML(ЗаписьXML, "param_value", Данные.КодАльфа2СтраныЮрлицаКонтрагента);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // }} add_info
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("add_info");
	ЗаписатьЭлементXML(ЗаписьXML, "param_code", "OTHR");
	ЗаписатьЭлементXML(ЗаписьXML, "param_value", "DVP STRANA " + Данные.КодАльфа2СтраныЮрлицаКонтрагента);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // }} add_info
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // }} add_informs
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLПодтверждающиеДокументы(ЗаписьXML, Данные)
	// {{ documents
	ЗаписьXML.ЗаписатьНачалоЭлемента("documents");
	// {{ document
	ЗаписьXML.ЗаписатьНачалоЭлемента("document");
	
	ЗаписатьЭлементXML(ЗаписьXML, "ndc_code",		"VLCN");
	ЗаписатьЭлементXML(ЗаписьXML, "partad_code",	"OTHR");
	ЗаписатьЭлементXML(ЗаписьXML, "doc_num",		"БН");
	ЗаписатьЭлементXML(ЗаписьXML, "doc_date",		ФорматДаты(Данные.ДатаСделки));
	
	// }} document
	ЗаписьXML.ЗаписатьКонецЭлемента();
	// }} documents
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLСуммаСделкиВалюта(ЗаписьXML, Данные)
	ЗаписатьЭлементXML(ЗаписьXML, "sec_price", Формат(Данные.СуммаСделки, "ЧГ=;ЧРД=."));
	Если ЗначениеЗаполнено(Данные.ВалютаБанковскогоСчета) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "curr_code", Справочники.Валюты.ПредставлениеВалюты(Данные.ВалютаБанковскогоСчета));
	Иначе
		Возврат ОшибкаПустаяВалютаБанковскогоСчета(Данные);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Процедура ЗаписатьЭлементыXMLИнформацияОСчетеВМестеРасчетов(ЗаписьXML, Данные)
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента) Тогда
		СчетДепо = Данные.СчетДепоКонтрагента;
		Если ЗначениеЗаполнено(СчетДепо.СчетВМестеРасчетовКодКлиента) Тогда
			ЗаписатьЭлементXML(ЗаписьXML, "pr_client_code", СокрЛП(СчетДепо.СчетВМестеРасчетовКодКлиента));
		КонецЕсли;
		Если ЗначениеЗаполнено(СчетДепо.СчетВМестеРасчетовНаименованиеКлиента) Тогда
			ЗаписатьЭлементXML(ЗаписьXML, "pr_client_name", СокрЛП(СчетДепо.СчетВМестеРасчетовНаименованиеКлиента));
		КонецЕсли;
		Если ЗначениеЗаполнено(СчетДепо.СчетВМестеРасчетовНомерСчетаКлиента) Тогда
			ЗаписатьЭлементXML(ЗаписьXML, "pr_client_acc", СокрЛП(СчетДепо.СчетВМестеРасчетовНомерСчетаКлиента));
		КонецЕсли;
		Если ЗначениеЗаполнено(СчетДепо.БикКлиентаОтправителяПолучателя) Тогда
			ЗаписатьЭлементXML(ЗаписьXML, "pr_client_bic", СокрЛП(СчетДепо.БикКлиентаОтправителяПолучателя));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция РезультатЗаписиXMLЦенныеБумагиВсеДанные(ЗаписьXML, Данные, ВыводитьISIN)
	// {{ Ценные бумаги
	ЗаписьXML.ЗаписатьНачалоЭлемента("securities");
	// {{ Ценная бумага
	ЗаписьXML.ЗаписатьНачалоЭлемента("security");
	// Код ЦБ в НДЦ
	Если ЗначениеЗаполнено(Данные.КодЦБ) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "security_c", СокрЛП(Данные.КодЦБ));
	Иначе
		Возврат ОшибкаПустойКодЗагрузкиЦеннойБумаги(Данные);
	КонецЕсли;
	// Количество ЦБ
	ЗаписатьЭлементXML(ЗаписьXML, "security_q", ФорматКоличества(Данные.КоличествоЦБ));
	// ISIN
	Если ВыводитьISIN И НЕ ПустаяСтрока(Данные.ISIN) Тогда
		ЗаписатьЭлементXML(ЗаписьXML, "security_isin", СокрЛП(Данные.ISIN));
	КонецЕсли;
	// }} Ценная бумага
	ЗаписьXML.ЗаписатьКонецЭлемента();
	// }} Ценные бумаги
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLЦенныеБумагиСУчетомISIN(ЗаписьXML, Данные)
	Возврат РезультатЗаписиXMLЦенныеБумагиВсеДанные(ЗаписьXML, Данные, Истина);
КонецФункции

Функция ЗаписатьЭлементыXMLЦенныеБумаги(ЗаписьXML, Данные)
	Возврат РезультатЗаписиXMLЦенныеБумагиВсеДанные(ЗаписьXML, Данные, Ложь);
КонецФункции

Функция ОшибкаПустойКодЗагрузкиЦеннойБумаги(Данные)
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	Ошибка.СообщениеВЖурнал = "Не указан код загрузки 'НДЦ' на " + Формат(Данные.Дата, "ДЛФ=Д") + " у ценной бумаги";
	Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + Данные.ЦеннаяБумага;
	Ошибка.Данные = Данные.ЦеннаяБумага;
	Возврат Ошибка;
КонецФункции

Функция ОшибкаПустойКодЗагрузкиКонтрагента(Данные)
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	Ошибка.СообщениеВЖурнал = "Не указан код загрузки 'НДЦ' на " + Формат(Данные.Дата, "ДЛФ=Д")	+ " у контрагента";
	Ошибка.СообщениеПользователю = Ошибка.СообщениеВЖурнал + " " + Данные.Контрагент;
	Ошибка.Данные = Данные.Контрагент;
	Возврат Ошибка;
КонецФункции

Функция ОшибкаПустаяВалютаБанковскогоСчета(Данные)
	Ошибка = Новый Структура("СообщениеПользователю,СообщениеВЖурнал,Данные");
	Ошибка.СообщениеПользователю = "В поручении " + Данные.Поручение
		+ " не указан банковский счет или у банк.счета не указана валюта.";
	Ошибка.СообщениеВЖурнал = "В поручении не указан банковский счет или у банк.счета не указана валюта.";
	Ошибка.Данные = Данные.Поручение;
	Возврат Ошибка;
КонецФункции

Функция ФорматДаты(Дата)
	Возврат Формат(Дата, "ДФ=""гггг-ММ-дд""");
КонецФункции

Функция ФорматКоличества(Количество)
	Возврат Формат(Количество, "ЧРД=.;ЧН=0;ЧГ=0");
КонецФункции

Функция НомерВерсии(КодОперации)
	
	НомерВерсии = "";
	Если ЗначениеЗаполнено(КодОперации) Тогда
		ВосстановитьЗначенияРеквизитовПоУмолчанию();
		
		Отбор = Новый Структура;
		Отбор.Вставить("КодОперации", КодОперации);
		НайденныеСтроки = НомераВерсий.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
			НомерВерсии = СокрЛП(НайденныеСтроки[0].НомерВерсии);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НомерВерсии;
	
КонецФункции 

Функция РезультатЗаписиXMLПереводМеждуСчетамиДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации)
	// {{ MF010
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF010");
	
	// Отправитель
	ЗаписатьЭлементXML(ЗаписьXML, "deponent_c",	КодЗагрузкиОрганизации);
	// Счет депо отправителя
	ЗаписатьЭлементXML(ЗаписьXML, "dep_acc_c",	СокрЛП(Данные.СчетДепоМХКод));
	// Раздел счета депо отправителя
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c",		СокрЛП(Данные.РазделСчетаДепоМХКод));
	
	// Получатель
	ЗаписатьЭлементXML(ЗаписьXML, "corr_code",	КодЗагрузкиОрганизации);
	
	// Счет депо получателя
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента)
		И ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчета) Тогда
		corr_acc_c = Данные.СчетДепоКонтрагента.СчетВМестеРасчетовНомерСчета;
	Иначе
		corr_acc_c = Данные.СчетДепоКонтрагентаКод;
	КонецЕсли;
	ЗаписатьЭлементXML(ЗаписьXML, "corr_acc_c",	СокрЛП(corr_acc_c));
	
	// Раздел счета депо получателя	
	ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_c",	СокрЛП(Данные.РазделСчетаДепоМХКонтрагентаКод));
	
	Если ЗначениеЗаполнено(Данные.НомерДепозитарногоДоговораКонтрагента) Тогда
		// Основание (депозитарный договор)
		ЗаписатьЭлементXML(ЗаписьXML, "based_on",	"Депозитарный договор");
		// Номер документа-основания
		ЗаписатьЭлементXML(ЗаписьXML, "based_numb",	СокрЛП(Данные.НомерДепозитарногоДоговораКонтрагента));
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.СчетДепоКонтрагента.ДатаЗаключенияДепозитарногоДоговора) Тогда
		// Дата документа основания
		ЗаписатьЭлементXML(ЗаписьXML, "based_date", ФорматДаты(
			Данные.СчетДепоКонтрагента.ДатаЗаключенияДепозитарногоДоговора));
	КонецЕсли;
	
	Ошибка = РезультатЗаписиXMLЦенныеБумагиСУчетомISIN(ЗаписьXML, Данные);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	
	// }} MF010
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLПереводМеждуРазделамиПоОдномуСчетуДепо(ЗаписьXML, Данные, КодЗагрузкиОрганизации)
	// {{ MF020
	ЗаписьXML.ЗаписатьНачалоЭлемента("MF020");
	
	// Номер счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "deponent_c",	КодЗагрузкиОрганизации);
	// Счет депо отправителя
	ЗаписатьЭлементXML(ЗаписьXML, "dep_acc_c",	СокрЛП(Данные.СчетДепоМХКод));
	// Раздел счета депо отправителя
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c",		СокрЛП(Данные.РазделСчетаДепоМХКод));	
	// Раздел счета депо получателя	
	ЗаписатьЭлементXML(ЗаписьXML, "corr_sec_c",	СокрЛП(Данные.РазделСчетаДепоМХКонтрагентаКод));
	
	Ошибка = РезультатЗаписиXMLЦенныеБумагиСУчетомISIN(ЗаписьXML, Данные);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Ошибка;
	КонецЕсли;
	
	// }} MF020
	ЗаписьXML.ЗаписатьКонецЭлемента();
	Возврат Неопределено;
КонецФункции

Функция РезультатЗаписиXMLОткрытиеРазделаСчетаМХ(ЗаписьXML, Данные)
	
	// {{ AF090
	ЗаписьXML.ЗаписатьНачалоЭлемента("AF090");
	
	// Счет депо
	ЗаписатьЭлементXML(ЗаписьXML, "depo_acc_c"	, СокрЛП(Данные.СчетДепоМХКод));
	// Основание (договор междепозитарного счета депо)
	ЗаписатьЭлементXML(ЗаписьXML, "based_on"	, "Договор междепозитарного счета депо");
	
	// {{ sections
	ЗаписьXML.ЗаписатьНачалоЭлемента("sections");
	
	// {{ section
	ЗаписьXML.ЗаписатьНачалоЭлемента("section");

	// Раздел счета депо
	ЗаписатьЭлементXML(ЗаписьXML, "sec_c"	, СокрЛП(Данные.РазделСчетаДепоМХКод));	
	// Статус анкеты
	ЗаписатьЭлементXML(ЗаписьXML, "change"	, 2);
	
	// }} section
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// }} sections
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	// }} AF090
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат Неопределено;
	
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
